{
    "abstractTypeDecl": {
        "signature": "type name",
        "parameters": {
            "type": "An abstract type definition associates a name with a type without specifying the type. In generated code, the type is specified externally (e.g., as a C++ class).",
            "name": "C++ type name"
        },
        "stateMap": [
            "type",
            "name"
        ]
    },
    "aliasTypeDecl": {
        "signature": "type name = typeName",
        "parameters": {
            "type": "An alias associates a name with a type that is defined elsewhere.",
            "name": "Alias name",
            "typeName": "Name of the underlying type for the alias to point to"
        }
    },
    "arrayDecl": {
        "signature": "array name = [ sizeExpression ] typeName (default defaultExpression)? (format formatLiteral)?",
        "parameters": {
            "array": "An array definition defines a new array type and associates a name with it.",
            "sizeExpression": "Size of array",
            "typeName": "Array element type",
            "defaultExpression": "Array default value",
            "formatLiteral": "Default string literal format to include in dictionary definition"
        },
        "stateMap": {
            "offset": 270,
            "map": {
                "array": [
                    0
                ],
                "name": [
                    1
                ],
                "=": [
                    2
                ],
                "[": [
                    3
                ],
                "sizeExpression": [
                    4
                ],
                "]": [
                    5
                ],
                "typeName": [
                    6
                ],
                "default": [
                    7,
                    9
                ],
                "defaultExpression": [
                    8
                ],
                "format": [
                    11,
                    13
                ],
                "formatLiteral": [
                    12
                ]
            }
        }
    },
    "commandDecl": {
        "signature": "commandKind command name (param-list)? (opcode opcodeExpr)? (priority priorityExpr)? queue-full-behavior?",
        "parameters": {
            "commandKind": "The command kind specifies the kind of the command. It is similar to the kind of a port instance specifier, except that different commands on the same port can have different kinds.",
            "command": "A command specifier specifies a command as part of a component definition.",
            "name": "Name of command",
            "param-list": "The parameter list specifies the command parameters. If there are no parameters, the list may be omitted. ref may not appear in any of the parameters.",
            "opcodeExpr": "opcode specifies the numeric opcode for the command. If it is present, its type must be convertible to Integer, and must evaluate to a nonnegative integer. If it is not present, then the default opcode is either zero (for the first opcode appearing in a component) or the previous opcode plus one.",
            "priorityExpr": "Specifies a priority for the command on the input queue. It must be convertible to Integer. The priority expression is valid only if the kind of the command is async.",
            "queue-full-behavior": "specifies the behavior of the command when the input full is queue. This specifier is valid only if the kind of the command is async. If no specifier appears, then the default behavior is assert."
        },
        "stateMap": {
            "offset": 352,
            "map": {
                "commandKind": [
                    0
                ],
                "command": [
                    1
                ],
                "name": [
                    2
                ],
                "opcodeExpression": [
                    7
                ],
                "priorityExpression": [
                    11
                ]
            }
        }
    },
    "componentInstanceDecl": {
        "signature": "instance name : component base id baseIdExpr (type C++ type)? (at includeFile)? (queue size queueSize)? (stack size stackSize)? (priority priorityExpr)? (cpu cpuExpr)? { init-specifier-sequence }",
        "parameters": {
            "instance": "A component instance definition defines an instance of a component that you can refer to in a topology definition.",
            "name": "Name of component instance",
            "component": "A qualified identifier referencing a component definition",
            "baseIdExpr": [
                "Associates a base identifier with the component instance.",
                " * Must evaluate to a nonnegative integer after type conversion.",
                " * For each component instance, for each command, event, telemetry, or parameter identifier, the identifier associated with the instance is computed by adding the base identifier specified here to the relative identifier specified in the component. For this purpose, command opcodes are identifiers.",
                " * For each instance, this procedure creates a range of identifiers, from the base identifier to the largest identifier associated with the instance. If the component has no identifiers, then this range is empty.",
                " * No instance may have a base identifier that lies within the identifier range of another instance."
            ],
            "C++ type": [
                "Names the implementation type of the instance",
                "The type must be a valid type in the target language (e.g., a type name in C++). If the implementation type is not present, then the code generator infers the name of the implementation type from the component name when generating the constructor for the instance.",
                "For Example:",
                "a. Suppose an FPP model has a component C defined in module M. Suppose I is an instance of component `M.C`. By default, the implementation type associated with I is `M::C`.",
                "b. Specifying type `M::D` causes FPP to generate a constructor for I with name `M::D` instead of `M::C`.",
                "",
                "Specifying an implementation type is useful in cases where the name of the component implementation does not match the component name, e.g., because there are several implementations of the same FPP component."
            ],
            "includeFile": "File path, relative to the location of the component instance definition. The file path must name a file in the target language (e.g., a C++ header file) that provides the implementation associated with the instance. If no such path is given, then the translator uses the location of the component instance and the name of the component to generate a default implementation path.",
            "queueSize": [
                "Specifies the queue size for active and queued components. The queue size is required for active and queued components and is not allowed for passive components.",
                "Must evaluate to a nonnegative integer after type conversion."
            ],
            "stackSize": [
                "Specifies the stack size in bytes for active components. The stack size is optional for active components and is not allowed for queued or passive components.",
                "Must evaluate to a nonnegative integer after type conversion."
            ],
            "priorityExpr": "Specifies the thread priority for active components. The priority is optional for active components and is not allowed for queued or passive components.",
            "cpuExpr": "Specifies the CPU affinity for active components. The CPU affinity is optional for active components and is not allowed for queued or passive components."
        },
        "stateMap": {
            "offset": 835,
            "map": {
                "instance": [
                    0
                ],
                "name": [
                    1
                ],
                ":": [
                    2
                ],
                "component": [
                    3
                ],
                "base": [
                    4
                ],
                "id": [
                    5
                ],
                "baseIdExpr": [
                    6
                ],
                "C++ type": [
                    8
                ],
                "includeFile": [
                    12
                ],
                "queue size": [
                    15,
                    16
                ],
                "queueSize": [
                    17
                ],
                "stack size": [
                    20,
                    21
                ],
                "stackSize": [
                    22
                ],
                "priorityExpr": [
                    26
                ],
                "cpuExpr": [
                    30
                ]
            }
        }
    },
    "componentInstanceSpec": {
        "signature": "private? instance componentInstance",
        "parameters": {
            "instance": "A component instance specifier specifies that a component instance is part of a topology.",
            "private": "A private instance does not appear in a topology in which this topology is imported",
            "componentInstance": "The qualified identifier must refer to a component instance."
        },
        "stateMap": {
            "offset": 958,
            "map": {
                "private": [
                    0,
                    -1
                ],
                "instance": [
                    2
                ],
                "componentInstance": [
                    3
                ]
            }
        }
    },
    "constantDecl": {
        "signature": "constant name = expression",
        "parameters": {
            "constant": "A constant definition associates a name with a compile-time constant value. You can use the name in place of the value elsewhere in the model.",
            "name": "Name of constant",
            "expression": "expression must evaluate to a compile-time constant value."
        },
        "stateMap": [
            "constant",
            "name",
            "=",
            "expression"
        ]
    },
    "structMember": {
        "signature": "name: [n]? type (format formatLiteral)?",
        "parameters": {
            "name": "Name of struct member",
            "n": "Creates an array of size n",
            "type": "Member type"
        },
        "stateMap": {
            "offset": 290,
            "map": {
                "name": [
                    0
                ],
                ":": [
                    1
                ],
                "[": [
                    2
                ],
                "n": [
                    3
                ],
                "]": [
                    4
                ],
                "type": [
                    6,
                    8
                ],
                "format": [
                    9,
                    11
                ],
                "formatLiteral": [
                    10
                ]
            }
        }
    },
    "structDecl": {
        "signature": "struct name { members } (default defaultExpr)?",
        "parameters": {
            "struct": "A struct definition defines a new structure type and associates a name with it.",
            "name": "Name of struct type",
            "defaultExpr": "Specifies the default value associated with the type. The type of the expression must be convertible to T. If the expression specifies a value for a member with size greater than one, then the value is applied to each element."
        },
        "stateMap": {
            "offset": 325,
            "map": {
                "struct": [
                    0
                ],
                "name": [
                    1
                ],
                "{": [
                    2
                ],
                "}": [
                    23
                ],
                "default": [
                    24,
                    26
                ],
                "defaultExpr": [
                    25
                ]
            }
        }
    },
    "paramDecl": {
        "signature": "param name: type (default defaultExpr)? (id idExpr)? (set opcode setOpcode)? (save opcode saveOpcode)?",
        "parameters": {
            "param": "A parameter specifier specifies a parameter as part of a component definition.",
            "defaultExpr": "Specifies a default value for the parameter when it does not exist in the parameter database",
            "idExpr": "Specifies a numeric identifier for the parameter. Must be convertible to an integer.",
            "setOpcode": "Opcode of the command for setting the parameter.",
            "saveOpcode": "Opcode of the command for saving the parameter to the database."
        },
        "stateMap": {
            "offset": 369,
            "map": {
                "param": [
                    0
                ],
                "name": [
                    1
                ],
                ":": [
                    2
                ],
                "type": [
                    3
                ],
                "default": [
                    6,
                    4
                ],
                "defaultExpr": [
                    5
                ],
                "id": [
                    10,
                    8
                ],
                "idExpr": [
                    9
                ],
                "set opcode": [
                    15,
                    12,
                    13
                ],
                "setOpcode": [
                    14
                ],
                "save opcode": [
                    20,
                    17,
                    18
                ],
                "saveOpcode": [
                    19
                ]
            }
        }
    },
    "generalPortInstanceDecl": {
        "signature": "generalPortKind port name : [portNum]? port-instance-type (priority priorityExpr)? queue-full-behavior?",
        "parameters": {
            "port": "Specifies an instantiated port as part of a component definition.",
            "portNum": "Number of port instances to instatiate",
            "priorityExpr": "Applies to the component’s message queue and may appear only for async input ports. The meaning of the priority value is operating system-dependent.",
            "queue-full-behavior": [
                "The optional queue-full-behavior specifies the behavior when a message is received and the queue is full:",
                " * assert means that an assertion fails, terminating FSW.",
                " * block means that the sender is blocked until there is space on the queue for the message.",
                " * drop means that the message is dropped.",
                " * This specifier is valid only for async input ports. If no specifier appears, then the default behavior is assert."
            ]
        },
        "stateMap": {
            "offset": 433,
            "map": {
                "generalPortKind": [
                    0
                ],
                "port": [
                    1
                ],
                "name": [
                    2
                ],
                ":": [
                    3
                ],
                "[": [
                    4
                ],
                "portNum": [
                    5
                ],
                "]": [
                    6
                ],
                "port-instance-type": [
                    8,
                    10
                ],
                "priority": [
                    13,
                    11
                ],
                "priorityExpr": [
                    12
                ],
                "queue-full-behavior": [
                    16,
                    15
                ]
            }
        }
    },
    "specialPortInstanceDecl": {
        "signature": "specialPortKind port name",
        "parameters": {
            "port": "These port instances correspond to the \"role ports\" in the F Prime XML model. Their types and other attributes are specified by F Prime. The identifier specifies the name of the port."
        },
        "stateMap": [
            "specialPortKind",
            "port",
            "name"
        ]
    },
    "telemetryChannelDecl": {
        "signature": "telemetry name : type (id idExpr) (update telemetry-update)? (format formatLiteral)? ( low { telemetryLow } )? ( high { telemetryHigh } )?",
        "parameters": {
            "telemetry": "Defines a telemetry channel as part of a component definition.",
            "telemetry-update": "Specifies whether the telemetry channel is emitted always or on change. If the specifier is not present, the default behavior is always.",
            "formatLiteral": "Specifies a format string. There is one argument to the format string, which is the channel value.",
            "lowLimit": "Specifies the low limit for the channel",
            "highLimit": "Specifies the high limit for the channel"
        },
        "stateMap": {
            "offset": 488,
            "map": {
                "telemetry": [
                    0
                ],
                "name": [
                    1
                ],
                ":": [
                    2
                ],
                "type": [
                    3
                ],
                "id": [
                    6,
                    4
                ],
                "idExpr": [
                    5
                ],
                "update": [
                    10,
                    8
                ],
                "telemetry-update": [
                    9
                ],
                "format": [
                    14,
                    12
                ],
                "formatLiteral": [
                    13
                ],
                "low": [
                    18,
                    16
                ],
                "lowLimit": [
                    17
                ],
                "high": [
                    22,
                    20
                ],
                "highLimit": [
                    21
                ]
            }
        }
    },
    "eventDecl": {
        "signature": "event name param-list? severity severityKeyword (id idExpr)? format formatLiteral (throttle throttleExpr)?",
        "parameters": {
            "event": "Defines a C++ interface for logging runtime events",
            "severityKeyword": "Severity of the event",
            "formatLiteral": "Format string that formats the event for display on the ground. The arguments to the format string are the values bound to the event parameters. A numeric format is allowed for any argument whose type is a numeric type.",
            "throttleExpr": "Specifies the maximum number of times to emit the event before throttling it. The type of e must be convertible to Integer and must evaluate to an integer."
        },
        "stateMap": {
            "offset": 766,
            "map": {
                "event": [
                    0
                ],
                "name": [
                    1
                ],
                "param-list": [
                    2,
                    3
                ],
                "severity": [
                    5
                ],
                "severityKeyword": [
                    6
                ],
                "id": [
                    7
                ],
                "idExpr": [
                    8
                ],
                "format": [
                    9,
                    11
                ],
                "formatLiteral": [
                    12
                ],
                "throttle": [
                    13,
                    15
                ],
                "throttleExpr": [
                    14
                ]
            }
        }
    },
    "includeStmt": {
        "signature": "include includeFile",
        "parameters": {
            "include": "Specifies that a file should be included in a translation unit.",
            "includeFile": [
                "The string literal specifies a file path relative to the location of the include specifier.",
                "The suffix .fppi is conventional for included files, to distinguish them from files presented directly for analysis or translation."
            ]
        },
        "stateMap": [
            "include",
            "includeFile"
        ]
    },
    "matchStmt": {
        "signature": "match target with source",
        "parameters": {
            "match": "Specifies that when the component is instantiated and connected into a topology, the corresponding port numbers of two of its port instances should match. For example, a port matching specifier could specify that for a health monitoring component, any component connected to its ping output port at port number n should also be connected to its ping input port at the same port number n.",
            "target": "Output port instance",
            "source": "Input port instance"
        },
        "stateMap": [
            "match",
            "target",
            "with",
            "source"
        ]
    },
    "internalPortDecl": {
        "signature": "internal port name param-list? (priority priorityExpr)? queue-full-behavior?",
        "parameters": {
            "internal": "Specifies a single-use port for use in handlers of the enclosing component. A component can use an internal port to send a message to itself.",
            "port": "Specifies a single-use port for use in handlers of the enclosing component. A component can use an internal port to send a message to itself.",
            "param-list": "Parameters sent as part of the internal message",
            "queue-full-behavior": "Same as async input ports"
        },
        "stateMap": {
            "offset": 791,
            "map": {
                "internal": [
                    0
                ],
                "port": [
                    1
                ],
                "name": [
                    2
                ],
                "param-list": [
                    3,
                    4
                ],
                "priority": [
                    6,
                    8
                ],
                "priorityExpr": [
                    7
                ],
                "queue-full-behavior": [
                    10,
                    11
                ]
            }
        }
    },
    "portDecl": {
        "signature": "port name param-list? (-> returnType)?",
        "parameters": {
            "port": "Defines an F Prime port. A port is the endpoint of a connection between F Prime components.",
            "param-list": "Parameters sent as part of the message",
            "returnType": "Return type used when port is invoked in a synchronous context"
        },
        "stateMap": {
            "offset": 948,
            "map": {
                "port": [
                    0
                ],
                "name": [
                    1
                ],
                "param-list": [
                    3,
                    2
                ],
                "->": [
                    7,
                    5
                ],
                "returnType": [
                    6
                ]
            }
        }
    },
    "connection": {
        "signature": "output -> input",
        "parameters": {
            "output": "Reference to the an output port instance",
            "->": "Connects output port on a component instance to an input port",
            "input": "Reference to an input port instance"
        },
        "stateMap": {
            "offset": 970,
            "map": {
                "output": [
                    0
                ],
                "->": [
                    1
                ],
                "input": [
                    2
                ]
            }
        }
    },
    "initSpecifier": {
        "signature": "phase phaseExpr codeLiteral",
        "parameters": {
            "phase": "Associates some code with a component instance. Usually this is initialization code, hence the name. It may also serve another purpose (e.g., teardown)",
            "phaseExpr": "Provides an integer identifier for an initialization phase.",
            "codeLiteral": "Code in a target language that is associated with the instance"
        },
        "stateMap": {
            "offset": 829,
            "map": {
                "phase": [
                    0,
                    2
                ],
                "phaseExpr": [
                    3
                ],
                "codeLiteral": [
                    4
                ]
            }
        }
    },
    "recordSpecifierDecl": {
        "signature": "product record name : type [array]? [id idExpr]?",
        "parameters": {
            "product": "Specifies a product record or container inside a component",
            "record": "Specifies a data product record as part of a component definition. A record is a unit of data that is stored in a container.",
            "name": "Name of data product record",
            "type": "Record type",
            "array": "Variable sized array of 'type'",
            "idExpr": "Override default record id"
        },
        "stateMap": {
            "offset": 804,
            "map": {
                "product": [
                    0
                ],
                "record": [
                    1
                ],
                "name": [
                    2
                ],
                ":": [
                    3
                ],
                "type": [
                    4
                ],
                "[array]?": [
                    5,
                    6
                ],
                "[id idExpr]?": [
                    10,
                    8
                ],
                "idExpr": [
                    9
                ]
            }
        }
    },
    "containerSpecifierDecl": {
        "signature": "product container name [id idExpr]? [default priority dpPriority]?",
        "parameters": {
            "product": "Specifies a product record or container inside a component",
            "container": "Specifies a data product container as part of a component definition. Containers are units of data that can be downlinked and then deleted. They hold data product records.",
            "name": "Name of data product container",
            "idExpr": "Override default container id",
            "dpPriority": "Override default container downlink priority"
        },
        "stateMap": {
            "offset": 816,
            "map": {
                "product": [
                    0
                ],
                "container": [
                    1
                ],
                "name": [
                    2
                ],
                "[id idExpr]?": [
                    5,
                    3
                ],
                "idExpr": [
                    4
                ],
                "[default priority dpPriority]?": [
                    10,
                    7
                ],
                "priority": [
                    8
                ],
                "dpPriority": [
                    9
                ]
            }
        }
    },
    "actionDef": {
        "signature": "action name [: type]?",
        "parameters": {
            "action": "Defines an action, i.e., a function that is called when the enclosing state machine performs a transition from a state or passes through a choice. Actions may carry data",
            "name": "Name of the action",
            "type": "Optional type name specifies the type T associated with the action. A value of type T will be passed into the function associated with the action when it is called"
        },
        "stateMap": {
            "offset": 512,
            "map": {
                "action": [
                    0
                ],
                "name": [
                    1
                ],
                "type": [
                    2,
                    3
                ]
            }
        }
    },
    "choiceDef": {
        "signature": "choice name { if guard thenTransition else elseTransition }",
        "parameters": {
            "choice": "Branch point controlled by a guard",
            "name": "Name of the choice",
            "guard": "Guard that controls the branch",
            "thenTransition": "Transition to execute if guard evaluates to true",
            "elseTransition": "Transition to execute if guard evaluates to false"
        }
    },
    "guardDef": {
        "signature": "guard name [: type]?",
        "parameters": {
            "guard": "Defines a guard, i.e., a function that returns a Boolean value. Guards are associated with state transitions and choices.",
            "name": "Name of the guard",
            "type": "Optional type name specifies the type T associated with the action. A value of type T will be passed into the function associated with the guard is evaluated"
        },
        "stateMap": {
            "offset": 540,
            "map": {
                "guard": [
                    0
                ],
                "name": [
                    1
                ],
                "type": [
                    2,
                    3
                ]
            }
        }
    },
    "signalDef": {
        "signature": "signal name [: type]?",
        "parameters": {
            "action": "Defines a signal which is an input to a state machine that cause state transitions to occur",
            "name": "Name of the signal",
            "type": "Optional type name specifies the type of the data carried by the signal"
        },
        "stateMap": {
            "offset": 546,
            "map": {
                "signal": [
                    0
                ],
                "name": [
                    1
                ],
                "type": [
                    2,
                    3
                ]
            }
        }
    },
    "stateMachineInstance": {
        "signature": "state machine instance name : stateMachine [priority priorityExpr]? queueFull?",
        "parameters": {
            "state": "",
            "machine": "",
            "instance": "Instantiates a state machine as part of a component",
            "stateMachine": "State machine to instantiate",
            "priorityExpr": "Priority has the same semantics as IPC priority",
            "queueFull": "Action to take when message queue has been filled"
        },
        "stateMap": {
            "offset": 686,
            "map": {
                "state": [
                    0
                ],
                "machine": [
                    1
                ],
                "instance": [
                    2
                ],
                "name": [
                    3
                ],
                "stateMachine": [
                    5
                ],
                "[priority priorityExpr]?": [
                    6,
                    7,
                    8
                ],
                "queueFull?": [
                    10
                ]
            }
        }
    }
}